In [1]:
import pandas as pd

import numpy as np

#### Example 1

In [17]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                           'foo', 'bar', 'foo', 'foo'],
                    'B' : ['one', 'one', 'two', 'three',
                           'two', 'two', 'one', 'three'],
                    'C' : np.random.randn(8),
                    'D' : [100]*8})

In [27]:
df

     A      B         C    D
0  foo    one  0.264834  100
1  bar    one -0.803832  100
2  foo    two -0.536437  100
3  bar  three -0.691424  100
4  foo    two  0.745520  100
5  bar    two -1.166605  100
6  foo    one -1.471297  100
7  foo  three  0.176468  100

Split by index (rows)

In [25]:
df.groupby('A').C.sum()

A
bar   -2.661861
foo   -0.820912
Name: C, dtype: float64

Split by columns (not understand very well when I would use this)

In [18]:
def get_letter_type(letter):
    if letter.lower() in 'aeiou':
        return 'vowel'
    else:
        return 'consonant'

In [19]:
grouped = df.groupby(get_letter_type, axis=1)

In [21]:
grouped.D.sum()

consonant    300
vowel        100
Name: D, dtype: int64

In [23]:
grouped.sum()

    consonant vowel
0  100.264834   foo
1   99.196168   bar
2   99.463563   foo
3   99.308576   bar
4  100.745520   foo
5   98.833395   bar
6   98.528703   foo
7  100.176468   foo

--- 
#### Example 2

In [28]:
lst = [1, 2, 3, 1, 2, 3]

In [30]:
s = pd.Series([1, 2, 3, 10, 20, 30], lst)

In [39]:
grouped = s.groupby(level=0, sort=False) # The last argument is a potential speedups

Note: This is a valid `mapping`, but no spliting occurs here yet.

In [36]:
grouped

Now we have a `split`

In [35]:
grouped.first() # grouped.last() or sum()

1    1
2    2
3    3
dtype: int64

--- 
#### Example 3

In [40]:
df3 = pd.DataFrame({'X' : ['A', 'B', 'A', 'B'], 'Y' : [1, 4, 3, 2]})

In [48]:
df3

   X  Y
0  A  1
1  B  4
2  A  3
3  B  2

In [43]:
# [?] When I pass the label that i want to map, we have a straighforward mapping?

df3.groupby(['X']).get_group('A') # its like a filter?

   X  Y
0  A  1
2  A  3

In [44]:
df3.groupby(['X']).groups

{'A': Int64Index([0, 2], dtype='int64'),
 'B': Int64Index([1, 3], dtype='int64')}

In [45]:
df3.groupby(get_letter_type, axis=1).groups

{'consonant': Index(['X', 'Y'], dtype='object')}

In [47]:
df3.groupby(get_letter_type, axis=1).sum()

   consonant
0          1
1          4
2          3
3          2

Stoped at: GroupBy with MultiIndexÂ¶